artillery.yml
config:
  target: 'http://localhost:3400'
  processor: "./my-functions.js"
  phases:
    - duration: 60
      arrivalRate: 350
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - function: "generateRandomData"
    - loop:
      - get:
          url: "/api/{{id}}"
      count: 10